# StructuralSectionShape Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
AnalyticalMember..::..StructuralSectionShape Property
AnalyticalMember Class See Also
---
The structural section shape of the Analytical Member.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2023
# Syntax
C#
---
```text
public StructuralSectionShape StructuralSectionShape { get; }
```

Visual Basic
---
```text
Public ReadOnly Property StructuralSectionShape As StructuralSectionShape
	Get
```

Visual C++
---
```text
public:
property StructuralSectionShape StructuralSectionShape {
	StructuralSectionShape get ();
}
```

# See Also
AnalyticalMember Class
Autodesk.Revit.DB.Structure Namespace